/*


1.写一个电灯(Lamp)类,
有如下属性:
    额定电压, 额定电流, 工作状态(开启/关闭)
有如下方法:
    求额定功率 int W()
    开灯 void LightOn()
    关灯 void LightOff()
    向控制台输出当前工作状态 void Status()

    
2.写一个圆形(Circular)类
有如下属性:
    半径, 圆心纵坐标位置, 圆心横坐标位置
有如下方法:
    求面积 double Area()
    根据输入的面积设定半径 void SetRadius(float radius)
    向控制台输出半径和面积 void Info()

    圆面积: 3.14*半径*半径     求平方根: Math.Sqrt(num) (比如求4的平方根是Math.Sqrt(4) )


3.实例化一个电灯(Lamp)对象,
设定这个对象的工作状态为开, 输出这个对象的状态信息;
然后设定工作状态为关, 输出这个对象的状态信息


4.实例化一个圆形(Circular)对象,
设定一个半径, 向控制台输出这个圆形当前的半径和面积信息;
根据一个面积为当前圆形设定一个半径, 再输出一遍信息



 */